SnowFlake =
{140,{1.2540383223269e-015,-20.48},{17.736200269506,-10.24},{17.736200269506,10.24},{1.2540383223269e-015,20.48},{-17.736200269506,10.24},{-17.736200269506,-10.24},{2.5080766446538e-015,-40.96},{35.47240053901,-20.48},{35.47240053901,20.48},{2.5080766446538e-015,40.96},{-35.47240053901,20.48},{-35.47240053901,-20.48},{3.7621149669806e-015,-61.44},{53.208600808516,-30.72},{53.208600808516,30.72},{3.7621149669806e-015,61.44},{-53.208600808516,30.72},{-53.208600808516,-30.72},{5.0161532893076e-015,-81.92},{70.944801078022,-40.96},{70.944801078022,40.96},{5.0161532893076e-015,81.92},{-70.944801078022,40.96},{-70.944801078022,-40.96},{6.2701916116344e-015,-102.4},{88.681001347528,-51.2},{88.681001347528,51.2},{6.2701916116344e-015,102.4},{-88.681001347528,51.2},{-88.681001347528,-51.2},{7.5242299339616e-015,-122.88},{106.41720161703,-61.44},{106.41720161703,61.44},{7.5242299339616e-015,122.88},{-106.41720161703,61.44},{-106.41720161703,-61.44},{8.778268256288e-015,-143.36},{124.15340188654,-71.68},{124.15340188654,71.68},{8.778268256288e-015,143.36},{-124.15340188654,71.68},{-124.15340188654,-71.68},{1.0032306578615e-014,-163.84},{141.88960215605,-81.92},{141.88960215605,81.92},{1.0032306578615e-014,163.84},{-141.88960215605,81.92},{-141.88960215605,-81.92},{1.1286344900942e-014,-184.32},{159.62580242555,-92.16},{159.62580242555,92.16},{1.1286344900942e-014,184.32},{-159.62580242555,92.16},{-159.62580242555,-92.16},{31.038350471634,-53.76},{46.557525707451,-44.8},{62.076700943269,-17.92},{62.076700943269,0},{62.076700943269,17.92},{46.557525707451,44.8},{31.038350471634,53.76},{15.519175235817,62.72},{4.3891341281442e-015,71.68},{-15.519175235817,62.72},{-31.038350471634,53.76},{-46.557525707451,44.8},{-62.076700943269,17.92},{-62.076700943269,7.6022033111802e-015},{-62.076700943269,-17.92},{-46.557525707451,-44.8},{-31.038350471634,-53.76},{-15.519175235817,-62.72},{-1.3167402384433e-014,-71.68},{15.519175235817,-62.72},{46.557525707451,-80.64},{62.076700943269,-71.68},{77.595876179085,-62.72},{93.115051414904,-35.84},{93.115051414904,-17.92},{93.115051414904,0},{93.115051414904,17.92},{93.115051414904,35.84},{77.595876179085,62.72},{62.076700943269,71.68},{46.557525707451,80.64},{31.038350471634,89.6},{15.519175235817,98.56},{-15.519175235817,98.56},{-31.038350471634,89.6},{-46.557525707451,80.64},{-62.076700943269,71.68},{-77.595876179085,62.72},{-93.115051414904,35.84},{-93.115051414904,17.92},{-93.115051414904,1.140330496677e-014},{-93.115051414904,-17.92},{-93.115051414904,-35.84},{-77.595876179085,-62.72},{-62.076700943269,-71.68},{-46.557525707451,-80.64},{-31.038350471634,-89.6},{-15.519175235817,-98.56},{15.519175235817,-98.56},{31.038350471634,-89.6},{15.519175235817,-142.08},{-15.519175235817,-142.08},{-115.28530175178,-84.48},{-130.8044769876,-57.6},{-130.8044769876,57.6},{-115.28530175178,84.48},{-15.519175235817,142.08},{15.519175235817,142.08},{115.28530175178,84.48},{130.8044769876,57.6},{130.8044769876,-57.6},{115.28530175178,-84.48},{31.038350471634,-151.04},{-31.038350471634,-151.04},{-115.28530175178,-102.4},{-146.32365222342,-48.64},{-146.32365222342,48.64},{-115.28530175178,102.4},{-31.038350471634,151.04},{31.038350471634,151.04},{115.28530175178,102.4},{146.32365222342,48.64},{146.32365222342,-48.64},{115.28530175178,-102.4},{46.557525707451,-160},{-46.557525707451,-160},{-115.28530175178,-120.32},{-161.84282745924,-39.68},{-161.84282745924,39.68},{-115.28530175178,120.32},{-46.557525707451,160},{46.557525707451,160},{115.28530175178,120.32},{161.84282745924,39.68},{161.84282745924,-39.68},{115.28530175178,-120.32}}




-- Copy from here
----- Laptop
-- Curdir = "C:\\Users\\rlatj\\Desktop\\workingarea\\mapping\\euddraft0.9.10.12"
-- __MapDirSetting(__encode_cp949("C:\\Users\\rlatj\\Desktop\\workingarea\\mapping\\euddraft0.9.10.12")) -- 맵파일 경로(\를 \\로 바꿔야함)
-- __SubDirSetting(__encode_cp949(Curdir.."\\msu")) -- Main.lua 폴더경로 (\를 \\로 바꿔야함, 없으면 비우기)

----- Desktop
-- Curdir = "C:\\Users\\USER\\Desktop\\mapping\\euddraft0.9.10.12\\Mapping"
-- __MapDirSetting(__encode_cp949("C:\\Users\\USER\\Desktop\\mapping\\euddraft0.9.10.12\\Mapping")) -- 맵파일 경로(\를 \\로 바꿔야함)
-- __SubDirSetting(__encode_cp949(Curdir.."\\msu")) -- Main.lua 폴더경로 (\를 \\로 바꿔야함, 없으면 비우기)
-- End of VSC Compile Mode Initialization


--↓ Tep에 그대로 붙여넣기----------------------------------------
FP = P8
SetForces({P1,P2,P3,P4},{P5,P6,P7,P8},{},{},{P1,P2,P3,P4,P5,P6,P7,P8}) 
SetFixedPlayer(P8)
-- StartCtrig(1,nil,0,1,"C:\\Users\\rlatj\\Desktop\\workingarea\\mapping\\euddraft0.9.10.12")
StartCtrig(1,nil,0,1,"C:\\Users\\USER\\Desktop\\mapping\\euddraft0.9.10.12")
CJump(AllPlayers,0)
Include_DataTransfer()
Include_CBPaint()
Include_CtrigPlib(360,"Switch 254",1)
Include_64BitLibrary("Switch 255")
-- Include_MatheMatics(360)
---- Calculating death variable ----
SDspeed = 1000 // 29

P_Count = CreateNcode()
HumanPlayers = {P1,P2,P3,P4,P5,P6,P7,P8,P9,P10,P11,P12}

CJumpEnd(AllPlayers,0)
Enable_PlayerCheck()
ObserverChatToAll(FP, _Void(0xFF), nil, nil, 0)
NoAirCollisionX(FP)
DoActions(FP,{SetSpeed(SetTo, "#X2")})



Install_function()
Install_verifingPhase()
Install_plotshape()
Install_opening()
for i = 4, 7 do
    TriggerX(Force2, Always(), {SetMemoryB(0x58F32C + (i * 15) + 4, SetTo, 255)})
end
for i = 0, 3 do
    TriggerX(Force1, Always(), {SetMemoryB(0x58D088 + (i * 46) + 15, SetTo, 255)})
end
CIf(AllPlayers,{Switch("Switch 249", Set)})
Install_initial_system_setting()
-- Install_normalGunplot()
Install_SpecialGunplot()
Install_ExchangeTrigger()
Install_WaveTrigger()
Install_HealZoneTrigger()
Install_Neutral_bunkerTrigger()
Install_DonateNbanTrigger()
Install_ConvertMarineTrigger()
Install_CCMU()
Install_BGMPhase()
Install_HerounitTrigger()
-- Install_NormalGunPlotShape()
-- Install_SpecialGunPlotShape()
MiddleBossTrigger()
FinalBossTrigger()

CIfEnd()
EndCtrig()
ErrorCheck()
EUDTurbo(FP)
-- 에러 체크 함수 선언 위치 --
--↑Tep에 그대로 붙여넣기-----



for i = 0, 10 do
if i%2 == 0 then
Trigger {
	players = {P1},
	conditions = {
		Memory(0x640B60+0xDA*i, Exactly, 0xEABDB2EA);
		Memory(0x640B64+0xDA*i, Exactly, 0x203AA0B3);	
	},
	actions = {
		SetMemory(0x640B60+0xDA*i,SetTo,0);
		PreserveTrigger();
	}
}
Trigger {
	players = {P1},
	conditions = {
		Memory(0x640B60+0xDA*i, Exactly, 0x4E524157);
		Memory(0x640B64+0xDA*i, Exactly, 0x3A474E49);	
	},
	actions = {
		SetMemory(0x640B60+0xDA*i,SetTo,0);
		PreserveTrigger();
	}
}
else
Trigger {
	players = {P1},
	conditions = {
		MemoryX(0x640B5E + 0xDA*i, Exactly, 0xB2EA0000,0xFFFF0000);
		Memory(0x640B62 + 0xDA*i, Exactly, 0xA0B3EABD);	
		MemoryX(0x640B66 + 0xDA*i, Exactly, 0x203A,0xFFFF);
	},
	actions = {
		SetMemory(0x640B5E + 0xDA*i,SetTo,0);
		PreserveTrigger();
	}
}
Trigger {
	players = {P1},
	conditions = {
		MemoryX(0x640B5E + 0xDA*i, Exactly, 0x41570000,0xFFFF0000);
		Memory(0x640B62 + 0xDA*i, Exactly, 0x4E494E52);	
		MemoryX(0x640B66 + 0xDA*i, Exactly, 0x00003A47,0xFFFF);
	},
	actions = {
		SetMemory(0x640B5E + 0xDA*i,SetTo,0);
		PreserveTrigger();
	}
}
end
end

--[[
1. Compile 후 시나리오 손상은 특정 trigger의 문제일 가능성이 농후하다.
TEP3.0 기반 트리거 자체가 트리거 용량을 많이 잡아먹어서 어쩔수없는문제. Freeze를 끄면 어느정도 해결이 된다고 함. Mininii님 피셜 

2. 중벙 트리거 관련. 중벙 안에 있는 유닛은 Men 감지를 받아서 안에있는데 갑자기 P12로 뺏기거나 하는일은 절대없음

3. 이펙트쓰다가 데스값때문에 스캔 이미지값 꼬일수있으니 웬만하면 그냥 보스페이즈 아니면 드래그방지 플래그 걸고 유닛으로 이펙트 내는게 좋다고함.

4. CSPlot Action은 해당 줄의 CSPlot 도형 실행후, Execute 하는 단락임.



]]